<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"892e47f8a79167e43f3dcacf9edcce500642ef251e8ce8374a9fe8ad195d6281","plan_job_ref":"Job Create Terraform plan (DEV) #79 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14997491629","plan_out_hash":"5cc6c9a1ea5fbc5ad031749ee5313e0583b66873082e16263c2e738b2e4f3f12","plan_hash":"f08a8b58b6098a2f70b576fa76fd0d87c1d43ae3737ce5dc9b3870e8f4775f21","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.loki will be created
+   resource "helm_release" "loki" {
+       atomic                     = false
+       chart                      = "loki"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "loki"
+       namespace                  = "loki"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                loki:
                  commonConfig:
                    replication_factor: 1
                  schemaConfig:
                    configs:
                      - from: "2024-04-01"
                        store: tsdb
                        object_store: s3
                        schema: v13
                        index:
                          prefix: loki_index_
                          period: 24h
                  pattern_ingester:
                    enabled: true
                  limits_config:
                    allow_structured_metadata: true
                    volume_enabled: true
                  ruler:
                    enable_api: true
                
                minio:
                  enabled: true
                
                deploymentMode: SingleBinary
                
                singleBinary:
                  replicas: 1
                
                backend:
                  replicas: 0
                read:
                  replicas: 0
                write:
                  replicas: 0
                
                ingester:
                  replicas: 0
                querier:
                  replicas: 0
                queryFrontend:
                  replicas: 0
                queryScheduler:
                  replicas: 0
                distributor:
                  replicas: 0
                compactor:
                  replicas: 0
                indexGateway:
                  replicas: 0
                bloomCompactor:
                  replicas: 0
                bloomGateway:
                  replicas: 0
            EOT,
        ]
+       verify                     = false
+       version                    = "6.29.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #79](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14997491629)